# ViewPrintedEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewPrintedEventArgs Class
Members See Also
---
The event arguments used by the ViewPrinted event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public class ViewPrintedEventArgs : RevitAPIPostDocEventArgs
```

Visual Basic
---
```text
Public Class ViewPrintedEventArgs _
	Inherits RevitAPIPostDocEventArgs
```

Visual C++
---
```text
public ref class ViewPrintedEventArgs : public RevitAPIPostDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPostDocEventArgs Autodesk.Revit.DB.Events..::..ViewPrintedEventArgs
# See Also
ViewPrintedEventArgs Members
Autodesk.Revit.DB.Events Namespace